{
  "bos_token": {
    "content": "<s>",
    "lstrip": false,
    "normalized": false,
    "rstrip": false,
    "single_word": false
  },
  "eos_token": {
    "content": "</s>",
    "lstrip": false,
    "normalized": false,
    "rstrip": false,
    "single_word": false
  },
  "pad_token": {
    "content": "__PAD__",
    "lstrip": true,
    "normalized": false,
    "rstrip": true,
    "single_word": false
  },
  "unk_token": {
    "content": "__UNK__",
    "lstrip": true,
    "normalized": false,
    "rstrip": true,
    "single_word": false
  }
}
